# Taps
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

# Formulae
brew "ack"
brew "basedpyright"
brew "bat"
brew "cairo"
brew "chafa"
brew "coreutils"
brew "direnv"
brew "entr"
brew "eslint_d"
brew "fd"
brew "findutils"
brew "fzf"
brew "gh"
brew "giflib"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "hadolint"
brew "hyperfine"
brew "icu4c@76"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "koekeishiya/formulae/skhd"
brew "libb2"
brew "libgit2"
brew "libgit2@1.7"
brew "libpng"
brew "librsvg"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "markdownlint-cli2"
brew "moreutils"
brew "neovim"
brew "openssh"
brew "openssl@3"
brew "pandoc"
brew "pango"
brew "php"
brew "pinentry-mac"
brew "pipx"
brew "pixman"
brew "pkgconf"
brew "pngpaste"
brew "prettierd"
brew "pyenv"
brew "pyright"
brew "python-setuptools"
brew "qmk/qmk/qmk"
brew "readline"
brew "rename"
brew "ripgrep"
brew "screen"
brew "selene"
brew "shellcheck"
brew "shfmt"
brew "sqlite"
brew "ssh-copy-id"
brew "starship"
brew "stylua"
brew "task"
brew "tcl-tk"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "uv"
brew "vim"
brew "vscode-langservers-extracted"
brew "vtsls"
brew "wget"
brew "xz"
brew "zlib"
brew "zsh"

# Casks
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"

# VS Code Extensions
vscode "vscodevim.vim"

# Go
go "github.com/docker/docker-language-server/cmd/docker-language-server"

# UV
uv "mbake"
