# Taps
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "yqrashawn/goku"

# Formulae
brew "ack"
brew "basedpyright"
brew "bat"
brew "chafa"
brew "coreutils"
brew "curl"
brew "direnv"
brew "entr"
brew "eslint_d"
brew "fd"
brew "findutils"
brew "fzf"
brew "gh"
brew "go"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "hadolint"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "koekeishiya/formulae/skhd"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "markdownlint-cli2"
brew "moreutils"
brew "neovim"
brew "openssh"
brew "pandoc"
brew "pinentry-mac"
brew "pngpaste" # for https://github.com/epwalsh/obsidian.nvim?tab=readme-ov-file#setup
brew "prettierd"
brew "qmk/qmk/qmk"
brew "rename"
brew "ripgrep"
brew "selene"
brew "shellcheck"
brew "shfmt"
brew "ssh-copy-id"
brew "starship"
brew "stylua"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "uv"
brew "vim"
brew "vscode-langservers-extracted"
brew "vtsls"
brew "wget"
brew "yqrashawn/goku/goku"
brew "zsh"

# Casks
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"
cask "docker"
cask "ghostty"
cask "karabiner-elements"
cask "qmk-toolbox"

# Local (machine-specific, not committed)
local_brewfile = File.expand_path("Brewfile.local", __dir__)
eval(File.read(local_brewfile)) if File.exist?(local_brewfile)

# vim:ft=ruby
